app/Views/peminjam/peminjaman/index.php

SELECT *
FROM `pembayaran`
WHERE `id_peminjaman` = '43'
---
                        foreach ($peminjaman as $p):
                            // Ambil data pembayaran untuk peminjaman ini menggunakan database builder
                            $db = \Config\Database::connect();
                            $pembayaran = $db->table('pembayaran')
                                ->where('id_peminjaman', $p['id_peminjaman'])
                                ->get()
                                ->getRowArray();