app/Controllers/AlatController.php

SELECT *
FROM `category`
---
                }

                // Siapkan data untuk dikirim ke view
                $data = [
                    'alat' => $builder->get()->getResultArray(), // Eksekusi query dan ambil hasil sebagai array
                    'keyword' => $keyword, // Keyword untuk ditampilkan di form pencarian
                    'category' => $categoryModel->findAll() // Ambil semua kategori untuk filter
                ];

SELECT `alat`.*, `category`.`nama_category`
FROM `alat`
LEFT JOIN `category` ON `category`.`id_category` = `alat`.`id_category`
---
            $category = $this->request->getGet('category'); // Filter kategori

            // Query langsung ke database untuk memastikan harga muncul
            $builder = $alatModel->db->table('alat')
                ->select('alat.*, category.nama_category') // Pilih semua kolom alat + nama kategori
                ->join('category', 'category.id_category = alat.id_category', 'left'); // LEFT JOIN dengan tabel category