app/Controllers/DashboardPeminjam.php

SELECT `peminjaman`.*, `alat`.`merk`, `alat`.`tipe`, `alat`.`harga`
FROM `peminjaman`
JOIN `alat` ON `alat`.`id_hp` = `peminjaman`.`id_hp`
WHERE `peminjaman`.`id_user` = '15'
AND `peminjaman`.`status` IN ('Diajukan','Disetujui','Dipinjam','Menunggu_Pengembalian','Dikembalikan')
AND `peminjaman`.`deleted_at` IS NULL
ORDER BY `peminjaman`.`id_peminjaman` DESC
SELECT `pembayaran`.*, `alat`.`merk`, `alat`.`tipe`, `peminjaman`.`waktu` as `waktu_pinjam`, `peminjaman`.`tanggal_kembali`
FROM `pembayaran`
JOIN `peminjaman` ON `peminjaman`.`id_peminjaman` = `pembayaran`.`id_peminjaman`
JOIN `alat` ON `alat`.`id_hp` = `peminjaman`.`id_hp`
WHERE `pembayaran`.`id_user` = '15'
ORDER BY `pembayaran`.`id_pembayaran` DESC
 LIMIT 5
---
    public function peminjaman()
    {
        $idUser = session()->get('id_user');

        // ambil peminjaman milik user ini
        $peminjaman = $this->peminjamanModel
            ->select('peminjaman.*, alat.merk, alat.tipe, alat.harga')
            ->join('alat', 'alat.id_hp = peminjaman.id_hp')
            ->where('peminjaman.id_user', $idUser)
            ->whereIn('peminjaman.status', [
                'Diajukan',
                'Disetujui',
                'Dipinjam',
                'Menunggu_Pengembalian',
                'Dikembalikan'])
            ->orderBy('peminjaman.id_peminjaman', 'DESC')
            ->findAll();

        // Ambil riwayat pembayaran terbaru (5 terakhir)
        $pembayaranModel = new \App\Models\PembayaranModel();
        $riwayatPembayaran = $pembayaranModel
            ->select('pembayaran.*, alat.merk, alat.tipe, peminjaman.waktu as waktu_pinjam, peminjaman.tanggal_kembali')
            ->join('peminjaman', 'peminjaman.id_peminjaman = pembayaran.id_peminjaman')
            ->join('alat', 'alat.id_hp = peminjaman.id_hp')
            ->where('pembayaran.id_user', $idUser)
            ->orderBy('pembayaran.id_pembayaran', 'DESC')
            ->limit(5)
            ->findAll();

SELECT `harga`
FROM `alat`
WHERE `id_hp` = '75'
---
    public function kembalikan($id)
    {
        $kondisi = $this->request->getPost('kondisi_hp');
        $metodePembayaran = $this->request->getPost('metode_pembayaran');

        // Validasi metode pembayaran (wajib karena selalu ada biaya sewa)
        if (empty($metodePembayaran)) {
            return redirect()->back()->with('error', 'Metode pembayaran harus dipilih');
        }

        // Ambil data peminjaman
        $peminjaman = $this->peminjamanModel->find($id);
        if (!$peminjaman || $peminjaman['id_user'] != session()->get('id_user')) {
            return redirect()->to('/peminjam/peminjaman')->with('error', 'Data peminjaman tidak ditemukan');
        }

        // Ambil data alat untuk harga
        $alatModel = new \App\Models\AlatModel();
        $alatData = $alatModel->db->table('alat')
            ->select('harga')
            ->where('id_hp', $peminjaman['id_hp'])
            ->get()
            ->getRowArray();

UPDATE `peminjaman` SET `status` = 'Dikembalikan', `kondisi_hp` = 'baik', `tanggal_kembali` = '2026-02-16', `denda` = 0
WHERE `peminjaman`.`id_peminjaman` IN ('43')
---

        try {
            // Update peminjaman dengan status "Dikembalikan"
            $this->peminjamanModel->update($id, [
                'status' => 'Dikembalikan',
                'kondisi_hp' => $kondisi,
                'tanggal_kembali' => date('Y-m-d'),
                'denda' => $denda
            ]);

INSERT INTO `pembayaran` (`id_peminjaman`, `id_user`, `waktu`, `harga`, `metode_pembayaran`, `tanggal_bayar`, `status`, `subtotal`) VALUES ('43', '15', '2026-02-16 07:30:53', '75000.00', 'Tunai', '2026-02-16', 'Lunas', 75000)
UPDATE `alat` SET `status` = 'Tersedia', `updated_at` = '2026-02-16 07:30:53'
WHERE `alat`.`id_hp` IN ('75')
---
                'subtotal' => $totalPembayaran
            ];

            $db->table('pembayaran')->insert($dataPembayaran);

            // Update status alat menjadi Tersedia
            $alatModel->update($peminjaman['id_hp'], [
                'status' => 'Tersedia'
            ]);