app/Controllers/PetugasController.php

SELECT COUNT(*) AS `numrows` FROM `alat`
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
WHERE `status` = 'Diajukan'
AND `peminjaman`.`deleted_at` IS NULL
AND `status` = 'Disetujui'
AND `status` = 'Dikembalikan'
SELECT *
FROM `peminjaman`
WHERE `peminjaman`.`status` = 'Diajukan'
AND `peminjaman`.`deleted_at` IS NULL
ORDER BY `peminjaman`.`id_peminjaman` DESC
 LIMIT 5
---
    public function index()
    {
        // Validasi: Cek apakah user yang login adalah Petugas
        if (session()->get('role') != 'Petugas') {
            // Jika bukan petugas, redirect ke halaman login
            return redirect()->to('/login');
        }

        // Buat instance model yang dibutuhkan
        $alatModel = new \App\Models\AlatModel(); // Model untuk data alat
        $peminjamanModel = new \App\Models\PeminjamanModel(); // Model untuk data peminjaman

        // Hitung total alat/HP di database
        $data['totalAlat'] = $alatModel->countAll();

        // Hitung peminjaman dengan status "Diajukan" (menunggu persetujuan)
        // countAllResults(false) = hitung tanpa reset query builder
        $data['peminjamanMenunggu'] = $peminjamanModel->where('status', 'Diajukan')->countAllResults(false);

        // Hitung peminjaman dengan status "Disetujui"
        $data['peminjamanDisetujui'] = $peminjamanModel->where('status', 'Disetujui')->countAllResults(false);

        // Hitung total pengembalian (status "Dikembalikan")
        $data['totalPengembalian'] = $peminjamanModel->where('status', 'Dikembalikan')->countAllResults();

        // Ambil 5 peminjaman terbaru yang statusnya "Diajukan"
        $peminjamanMenunggu = $peminjamanModel
            ->where('peminjaman.status', 'Diajukan') // Filter status Diajukan
            ->orderBy('peminjaman.id_peminjaman', 'DESC') // Urutkan dari terbaru
            ->limit(5) // Batasi 5 data
            ->findAll(); // Ambil semua data